app/Controllers/AuthController.php

    public function registerPost()
    {
        $rules = [
            'name'     => 'required|min_length[2]|max_length[150]',
            'email'    => 'required|valid_email|is_unique[users.email]',
            'password' => 'required|min_length[8]',
            'confirm'  => 'required|matches[password]',
        ];

        if (! $this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $id = $this->userModel->insert([
            'name'           => $this->request->getPost('name'),
            'email'          => $this->request->getPost('email'),
            'password'       => password_hash($this->request->getPost('password'), PASSWORD_BCRYPT),
            'provider'       => 'local',
            'email_verified' => 1,
        ]);

        $user = $this->userModel->find($id);
---
INSERT INTO `users` (`name`, `email`, `password`, `provider`, `email_verified`, `created_at`, `updated_at`) VALUES ('Mufasa', 'mufasa@reyleon.com', '$2y$10$lV45Mbd0WURE6uDGTBlc0ekQjLIP09w1K3/i6co6VRltZAAAq3Us.', 'local', 1, '2026-02-27 16:14:19', '2026-02-27 16:14:19')
SELECT *
FROM `users`
WHERE `users`.`id` = 2