app/Controllers/PaymentController.php

    public function checkout(int $manualId): string
    {
        $manual = $this->manualModel->find($manualId);
---
SELECT *
FROM `manuals`
WHERE `manuals`.`id` = 1