app/Models/ManualModel.php

    public function getPortafolio(?string $category = null, ?string $level = null): array
    {
        $builder = $this->db->table('manuals m')
            ->select('m.*, c.name AS category_name, c.slug AS category_slug, c.icon AS category_icon')
            ->join('categories c', 'c.id = m.category_id')
            ->where('m.active', 1)
            ->orderBy('m.featured', 'DESC')
            ->orderBy('m.created_at', 'DESC');

        if ($category) {
            $builder->where('c.slug', $category);
        }
        if ($level) {
            $builder->where('m.level', $level);
        }

        return $builder->get()->getResultArray();
---
SELECT `m`.*, `c`.`name` AS `category_name`, `c`.`slug` AS `category_slug`, `c`.`icon` AS `category_icon`
FROM `manuals` `m`
JOIN `categories` `c` ON `c`.`id` = `m`.`category_id`
WHERE `m`.`active` = 1
ORDER BY `m`.`featured` DESC, `m`.`created_at` DESC

    public function getFeatured(int $limit = 6): array
    {
        return $this->db->table('manuals m')
            ->select('m.*, c.name AS category_name')
            ->join('categories c', 'c.id = m.category_id')
            ->where('m.active', 1)
            ->where('m.featured', 1)
            ->limit($limit)
            ->get()->getResultArray();
---
SELECT `m`.*, `c`.`name` AS `category_name`
FROM `manuals` `m`
JOIN `categories` `c` ON `c`.`id` = `m`.`category_id`
WHERE `m`.`active` = 1
AND `m`.`featured` = 1
 LIMIT 6