app/Models/OrderModel.php

    public function getUserPurchases(int $userId): array
    {
        return $this->db->table('orders o')
            ->select('o.*, m.title, m.cover_image, m.slug, dt.token, dt.expires_at, dt.used')
            ->join('manuals m', 'm.id = o.manual_id')
            ->join('download_tokens dt', 'dt.order_id = o.id', 'left')
            ->where('o.user_id', $userId)
            ->where('o.status', 'completed')
            ->orderBy('o.created_at', 'DESC')
            ->get()->getResultArray();
---
SELECT `o`.*, `m`.`title`, `m`.`cover_image`, `m`.`slug`, `dt`.`token`, `dt`.`expires_at`, `dt`.`used`
FROM `orders` `o`
JOIN `manuals` `m` ON `m`.`id` = `o`.`manual_id`
LEFT JOIN `download_tokens` `dt` ON `dt`.`order_id` = `o`.`id`
WHERE `o`.`user_id` = 2
AND `o`.`status` = 'completed'
ORDER BY `o`.`created_at` DESC

    public function hasPurchased(int $userId, int $manualId): bool
    {
        return $this->where('user_id', $userId)
                    ->where('manual_id', $manualId)
                    ->where('status', 'completed')
                    ->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `user_id` = 2
AND `manual_id` = 1
AND `status` = 'completed'